lisyaoran51/M0516_Test/AllPanelFunction/main.c
/**************************************************************************//**
 * @file     main.c
 * @version  V3.00
 * $Revision: 7 $
 * $Date: 15/07/13 1:27p $
 * @brief    Show how to set GPIO pin mode and use pin data input/output control.
 *
 * @note
 * Copyright (C) 2013 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/
#include <stdio.h>
#include "M051Series.h"
#include <string.h>
#include <stdlib.h>
#include <math.h>


#define PLLCON_SETTING      CLK_PLLCON_50MHz_HXT
#define PLL_CLOCK           50000000

/*---------------------------------------------------------------------------------------------------------*/
/* GPIO varaibles                                                                              						 */
/*---------------------------------------------------------------------------------------------------------*/

		/* first pad pressed time
		 * p~: pressed down time by timer with ms unit
		 */
		uint32_t pressedKeyTime[48] = {0};
		
		/* if the second pad is pressed
		 * 0: not pressed 
		 * 1: only pressed first pad
		 * 2: pressed the second pad
		 * 3: released the second pad
		 */
		uint8_t pressedKey[48] = {0};		
		
		uint8_t powerButton = 0;
		uint8_t sensitiveButton = 0;
		uint8_t sustainButton = 0;
		uint8_t lowerOctaceButton = 0;
		uint8_t raiseOctaceButton = 0;
		uint8_t pauseButton = 0;
		uint8_t speedButton = 0;
		
		uint8_t pedalpluggedIn = 0;
		uint8_t pedalDown = 0;
		
		/* forward: 0>1>0>1, backward: 0>2>0>2
		 * 0:floating state
		 * 1:foward state
		 * 2:backward state
		 */
		uint8_t sectionKnobState = 0;
		
		


/*---------------------------------------------------------------------------------------------------------*/
/* Define Function Prototypes                                                                              */
/*---------------------------------------------------------------------------------------------------------*/

void AdcContScanModeTest(void);


/*---------------------------------------------------------------------------------------------------------*/
/* ADC                                                                                                     */
/*---------------------------------------------------------------------------------------------------------*/
double sliderDataAccumulation[2] = {0};
int sliderDataAverage[2] = {0};
uint8_t adcScanCount = 0;
#define MaxAdcScanTimes 10.0

/*---------------------------------------------------------------------------------------------------------*/
/* indicator lights                                                                                        */
/*---------------------------------------------------------------------------------------------------------*/

uint8_t indicatorLights[16] = {0};

#define LatchPin P14
#define DataPin P15
#define ClockPin P17


/*---------------------------------------------------------------------------------------------------------*/
/* PWM lights                                                                                              */
/*---------------------------------------------------------------------------------------------------------*/

/* 
 * 0: turn off
 * 1: revolve around
 * 2: pause revolve around
 * 3: fading
 * 4: pause fading
 */
uint8_t pwmLightEffectType;

/*
 * unit: ms
 */
uint16_t pwmTimeLength;
uint16_t pwmTimeLengthLeft;




/*---------------------------------------------------------------------------------------------------------*/
/* I2C Start                                                                                               */
/*---------------------------------------------------------------------------------------------------------*/

uint8_t i2cWriteData[16][16];		// mcu write pi
uint8_t i2cReadData[16][16];		// mcu read pi

volatile uint8_t i2cWriteDataStartPos = 0;
volatile uint8_t i2cWriteDataEndPos = 0;

volatile uint8_t i2cReadDataStartPos = 0;
volatile uint8_t i2cReadDataEndPos = 0;

uint8_t i2cTempWriteBuffer[16] = {0};
uint8_t i2cTempReadBuffer[16] = {0};

volatile uint8_t writeDataLen = 0;
volatile uint8_t readDataLen = 0;


typedef void (*I2C_FUNC)(uint32_t u32Status);

static I2C_FUNC s_I2C0HandlerFn = NULL;

/*---------------------------------------------------------------------------------------------------------*/
/* I2C End                                                                                                 */
/*---------------------------------------------------------------------------------------------------------*/


/*---------------------------------------------------------------------------------------------------------*/
/* Timer function                                                                                          */
/*---------------------------------------------------------------------------------------------------------*/

/*
 * unit: ms
 */
volatile uint32_t timerCount = 0;

/*
 * last while loop run time
 */
uint32_t lastRunTimerCount = 0;

/*
 * last light display time
 */
uint32_t lastFrameTimerCount = 0;

/*
 * last adc scan time
 */
uint32_t lastAdcScanTimerCount = 0;

/*
 * debounce time
 */
uint32_t debounceTimerCount = 0;

/**
 * @brief       Timer0 IRQ
 *
 * @param       None
 *
 * @return      None
 *
 * @details     The Timer0 default IRQ, declared in startup_M051Series.s.
 */
void TMR0_IRQHandler(void)
{
    if(TIMER_GetIntFlag(TIMER0) == 1)
    {
        /* Clear Timer0 time-out interrupt flag */
        TIMER_ClearIntFlag(TIMER0);

        timerCount++;
    }
}

/*---------------------------------------------------------------------------------------------------------*/
/* Timer End                                                                                               */
/*---------------------------------------------------------------------------------------------------------*/

void SYS_Init(void)
{
    /*---------------------------------------------------------------------------------------------------------*/
    /* Init System Clock                                                                                       */
    /*---------------------------------------------------------------------------------------------------------*/

