lisyaoran51/M0516_Test/AllPanelFunction/main.c
								}
						}
						else if(pressedKey[pressedNum] == 2 || // means the second pad was pressed
										pressedKey[pressedNum] == 3){  // means after release second pad
								//printf("release [%d] - %d %d at %ds\n", pressedNum, i, j, timerCount);
								
								memset(tempCommand, 0x0, 16);
								sprintf(value, "%03d", 127 + 23 - pressedNum);
								strncpy(tempCommand, value, 3);
								strncat(tempCommand, ",-1", 3);
								memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
								i2cWriteDataEndPos++;
								if(i2cWriteDataEndPos == 16)
										i2cWriteDataEndPos = 0;
								
										
								//printf("%s\n", tempCommand);
								
								pressedKey[pressedNum] = 0;
						}
						else if(pressedKey[pressedNum] == 1){	// means on pressed first pad then release
								pressedKeyTime[pressedNum] = 0;
								pressedKey[pressedNum] = 0;
						}
						
				}
				else if(i == 9 || i ==11 || i == 13){	// press second pad
						if(GetPin(0, j) == 0){
								pressedNum = (i-8)/2*8+j;
								if(pressedKey[pressedNum] == 1){
										//printf("read input [%d] %d %d at %ds\n", pressedNum, i, j, timerCount);
										//printf("press [%d] %d %d with speed %ds, velocity %f \n", pressedNum, i, j, timerCount - pressedKeyTime[pressedNum], 
										//		pow(1.02476732964, (200 - (timerCount - pressedKeyTime[pressedNum])) * 1));
										pressedKey[pressedNum] = 2;
									
										memset(tempCommand, 0x0, 16);
										sprintf(value, "%03d", 127 + 23 - pressedNum);
										strncpy(tempCommand, value, 3);
										strncat(tempCommand, ",", 1);
										// 127 = 1.02476732964 exp(200-t) big power no difference
										// sprintf(value, "%03d", (int)pow(1.02476732964, (200 - (timerCount - pressedKeyTime[pressedNum])) * 1));
										// 127 = 1.01230792234 exp((200-t)*2) 
										sprintf(value, "%03d", (int)pow(1.01230792234, (200 - (timerCount - pressedKeyTime[pressedNum])) * 2));
										strncat(tempCommand, value, 3);
										memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
										i2cWriteDataEndPos++;
										if(i2cWriteDataEndPos == 16)
												i2cWriteDataEndPos = 0;
										
										//printf("%s\n", tempCommand);
									
								}
								//printf("read input [%d] %d %d at %ds\n", pressedNum, i, j, timerCount);
						}
				}
				else{
					
					if(GetPin(0, j) == 0){
							if(i ==14 && (j == 4 || j == 5)){
									switch(sectionKnobState){
									case 0:
											if(GetPin(0, 4) == 0 && GetPin(0, 5) != 0){
													sectionKnobState = 1;
													printf("section knob forward.\n");
												
													memset(tempCommand, 0x0, 16);
													sprintf(tempCommand, "1020,1");
													memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
													i2cWriteDataEndPos++;
													if(i2cWriteDataEndPos == 16)
															i2cWriteDataEndPos = 0;
												
											}
											else if(GetPin(0, 5) == 0 && GetPin(0, 4) != 0){
													sectionKnobState = 2;
													printf("section knob backward.\n");
													
													memset(tempCommand, 0x0, 16);
													sprintf(tempCommand, "1020,-1");
													memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
													i2cWriteDataEndPos++;
													if(i2cWriteDataEndPos == 16)
															i2cWriteDataEndPos = 0;
											}
											break;
									case 1:
									case 2:
											if(GetPin(0, 4) == 0 && GetPin(0, 5) == 0){
													sectionKnobState = 0;
													printf("section knob floating.\n");
											}
											break;
									}
							}
							else{
									if(i == 14){
											switch(j){
											case 1:
													if(sensitiveButton != 1){
															sensitiveButton = 1;
															printf("Press Sensitive button.\n");
														
															memset(tempCommand, 0x0, 16);
															sprintf(tempCommand, "1002,1");
															memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
															i2cWriteDataEndPos++;
															if(i2cWriteDataEndPos == 16)
																	i2cWriteDataEndPos = 0;
													}
													break;
											case 2:
													if(sustainButton != 1){
															sustainButton = 1;
															printf("Press Sustain button.\n");
															
															memset(tempCommand, 0x0, 16);
															sprintf(tempCommand, "1001,1");
															memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
															i2cWriteDataEndPos++;
															if(i2cWriteDataEndPos == 16)
																	i2cWriteDataEndPos = 0;
													}
													break;
											case 3:
													if(speedButton != 1){
															speedButton = 1;
															printf("Press Speed button.\n");
															
															memset(tempCommand, 0x0, 16);
															sprintf(tempCommand, "1003,1");
															memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
															i2cWriteDataEndPos++;
															if(i2cWriteDataEndPos == 16)
																	i2cWriteDataEndPos = 0;
													}
													break;
													
												
											}
										
									}
									else if(i ==15){
											switch(j){
											case 0:
													if(pauseButton != 1){
															pauseButton = 1;
															printf("Press Pause button.\n");
															
															memset(tempCommand, 0x0, 16);
															sprintf(tempCommand, "1012,1");
															memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
															i2cWriteDataEndPos++;
															if(i2cWriteDataEndPos == 16)
																	i2cWriteDataEndPos = 0;
													}
													break;
											case 1:
													if(raiseOctaceButton != 1){
															raiseOctaceButton = 1;
															printf("Press Raise octave button.\n");
														
															memset(tempCommand, 0x0, 16);
															sprintf(tempCommand, "1010,1");
															memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
															i2cWriteDataEndPos++;
															if(i2cWriteDataEndPos == 16)
																	i2cWriteDataEndPos = 0;
													}
													break;
											case 2:
													if(lowerOctaceButton != 1){
															lowerOctaceButton = 1;
															printf("Press Lower octave button.\n");
														
