lisyaoran51/M0516_Test/AllPanelFunction/main.c
															memset(tempCommand, 0x0, 16);
															sprintf(tempCommand, "1011,1");
															memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
															i2cWriteDataEndPos++;
															if(i2cWriteDataEndPos == 16)
																	i2cWriteDataEndPos = 0;
													}
													break;
											case 3:
													if(pedalDown != 1){
															pedalDown = 1;
															printf("Pedal Down.\n");
														
															memset(tempCommand, 0x0, 16);
															sprintf(tempCommand, "500,1");
															memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
															i2cWriteDataEndPos++;
															if(i2cWriteDataEndPos == 16)
																	i2cWriteDataEndPos = 0;
													}
													break;
											case 4:
													if(debounceTimerCount + 100 < timerCount){
															//printf("Speed knob forward.\n");
														
															memset(tempCommand, 0x0, 16);
														  sprintf(tempCommand, "1021,1");
														  memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
														  i2cWriteDataEndPos++;
														  if(i2cWriteDataEndPos == 16)
														  		i2cWriteDataEndPos = 0;
															debounceTimerCount = timerCount;
													}
													break;
											case 5:
													if(debounceTimerCount + 100 < timerCount){
															//printf("Speed knob backward.\n");
														
															memset(tempCommand, 0x0, 16);
															sprintf(tempCommand, "1021,-1");
															memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
															i2cWriteDataEndPos++;
															if(i2cWriteDataEndPos == 16)
																	i2cWriteDataEndPos = 0;
															debounceTimerCount = timerCount;
													}
													break;
											}
									}
								
								
									//printf("read input i:%d j:%d at %ds\n",i, j, timerCount);
							}
							// lower octave: i=15, j=2
							// raise octave: i=15, j=1
							// left button(velocity): i=14, j=2
							// right button(sustain): i=14, j=1
							// pause: i=15, j=0
							// speed button: i=14, j=3
							// speed forward(clockwise): i=15, j=4
							// speed backward(counterclockwise): i=15, j=5
							// section forward(clockwise): i=14, j=4&5 (->) i=14, j=4 (->) i=14, j=4&5
							// section backward(counterclockwise): i=14, j=4&5 (->) i=14, j=5 (->) i=14, j=4&5
							// pedal: i=15, j=3
					}
					else{
							if(i == 14){
									switch(j){
									case 1:
											if(sensitiveButton == 1){
													sensitiveButton = 0;
													printf("Release Sensitive button.\n");
												
													memset(tempCommand, 0x0, 16);
													sprintf(tempCommand, "1002,0");
													memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
													i2cWriteDataEndPos++;
													if(i2cWriteDataEndPos == 16)
															i2cWriteDataEndPos = 0;
											}
											break;
									case 2:
											if(sustainButton == 1){
													sustainButton = 0;
													printf("Release Sustain button.\n");
												
													memset(tempCommand, 0x0, 16);
													sprintf(tempCommand, "1001,0");
													memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
													i2cWriteDataEndPos++;
													if(i2cWriteDataEndPos == 16)
															i2cWriteDataEndPos = 0;
											}
											break;
									case 3:
											if(speedButton == 1){
													speedButton = 0;
													printf("Release Speed button.\n");
												
													memset(tempCommand, 0x0, 16);
													sprintf(tempCommand, "1003,0");
													memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
													i2cWriteDataEndPos++;
													if(i2cWriteDataEndPos == 16)
															i2cWriteDataEndPos = 0;
											}
											break;
									}
							}
							else if(i ==15){
									switch(j){
									case 0:
											if(pauseButton == 1){
													pauseButton = 0;
													printf("Release Pause button.\n");
												
													memset(tempCommand, 0x0, 16);
													sprintf(tempCommand, "1012,0");
													memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
													i2cWriteDataEndPos++;
													if(i2cWriteDataEndPos == 16)
															i2cWriteDataEndPos = 0;
											}
											break;
									case 1:
											if(raiseOctaceButton == 1){
													raiseOctaceButton = 0;
													printf("Release Raise octave button.\n");
												
													memset(tempCommand, 0x0, 16);
													sprintf(tempCommand, "1010,0");
													memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
													i2cWriteDataEndPos++;
													if(i2cWriteDataEndPos == 16)
															i2cWriteDataEndPos = 0;
											}
											break;
									case 2:
											if(lowerOctaceButton == 1){
													lowerOctaceButton = 0;
													printf("Release Lower octave button.\n");
												
													memset(tempCommand, 0x0, 16);
													sprintf(tempCommand, "1011,0");
													memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
													i2cWriteDataEndPos++;
													if(i2cWriteDataEndPos == 16)
															i2cWriteDataEndPos = 0;
											}
											break;
									case 3:
											if(pedalDown == 1){
													pedalDown = 0;
													printf("Pedal Up.\n");
												
													memset(tempCommand, 0x0, 16);
													sprintf(tempCommand, "500,0");
													memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
													i2cWriteDataEndPos++;
													if(i2cWriteDataEndPos == 16)
															i2cWriteDataEndPos = 0;
											}
											break;
									case 4:
											// avoid continuous signal
													//printf("Remove Speed knob forwarded state.\n");
											break;
									case 5:
											// avoid continuous signal
													//printf("Remove Speed knob backwarded state.\n");
											break;
									}
							}
					}
				}
			}
		}
		
		if(GetPin(4, 0) == 1){
				if(powerButton == 0){
						powerButton = 1;
						printf("Press power button.\n");
					
