lisyaoran51/M0516_Test/AllPanelFunction/main.c
						memset(tempCommand, 0x0, 16);
						sprintf(tempCommand, "1000,1");
						memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
						i2cWriteDataEndPos++;
						if(i2cWriteDataEndPos == 16)
								i2cWriteDataEndPos = 0;
				}
		}
		else{
				if(powerButton == 1){
						powerButton = 0;
						printf("Release power button.\n");
						
						memset(tempCommand, 0x0, 16);
						sprintf(tempCommand, "1000,0");
						memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
						i2cWriteDataEndPos++;
						if(i2cWriteDataEndPos == 16)
								i2cWriteDataEndPos = 0;
				}
		}
		
		if(GetPin(1, 3) == 1){
				if(pedalpluggedIn == 0){
						pedalpluggedIn = 1;
						printf("Pedal plugged in.\n");
					
						memset(tempCommand, 0x0, 16);
						sprintf(tempCommand, "1502,1");
						memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
						i2cWriteDataEndPos++;
						if(i2cWriteDataEndPos == 16)
								i2cWriteDataEndPos = 0;
				}
		}
		else{
				if(pedalpluggedIn == 1){
						pedalpluggedIn = 0;
						printf("Pedal plugged out.\n");
					
						memset(tempCommand, 0x0, 16);
						sprintf(tempCommand, "1502,0");
						memcpy(i2cWriteData[i2cWriteDataEndPos], tempCommand, 16);
						i2cWriteDataEndPos++;
						if(i2cWriteDataEndPos == 16)
								i2cWriteDataEndPos = 0;
				}
		}
		
		//printf("power:%d pedal:%d\n", P40, P13);
		
}

/*
 * Light number: 
 * -1: turn off all lights
 * 0: power
 * 1: sentivity
 * 2: sustain
 * 3: raise octave
 *    *13
 * *8    *12
 * *9    *11
 *    *10
 * 14: lower octave
 */
void SetIndicatorLights(int lightNumber, int on){
		
		// 0: power
		// 1: sentivity
		// 2: sustain
		// 3: raise octave
		//    *13
		// *8    *12
		// *9    *11
		//    *10
		// 14: lower octave
	
		uint8_t i, j;
	
		if(lightNumber > 15)
				return ;
	
		if(lightNumber < 0){
			  for(i = 0; i < 16; i++){
						indicatorLights[i] = 0;
				}
		}
		else{
				
				if(on == 1)
					indicatorLights[lightNumber] = 1;
				else if(on == 0)
					indicatorLights[lightNumber] = 0;
		}
	
		// https://ddddiy.blogspot.com/2014/02/74hct595n.html
		for(i = 0; i < 16; i++){
				LatchPin = 0;
				for(j = 15; j < 16; j--){
						ClockPin = 0;
						
						if(indicatorLights[j] == 1)
							DataPin = 1;
						else
							DataPin = 0;
						
						ClockPin = 1;
				}
				LatchPin = 1;
			
		}
}

/* positive speed	
 *    *0
 * *     *1
 * *4    *2
 *    *3
 * negative speed
 *    *0
 * *-1   *
 * *-2   *-4
 *    *-3
 *
 * 5: reset
 */
void SetSpeedKnobLightRing(int lightNumber){
		//    *13
		// *8    *12
		// *9    *11
		//    *10
	
		uint8_t i, j;
	
		if(lightNumber > 5 || lightNumber < -4)
				return ;
		
		// reset light ring
		for(i = 8; i < 14; i++)
				indicatorLights[i] = 0;
		
		if(lightNumber < 0){
				indicatorLights[13] = 1;
				for(i = 8; i < 8 - lightNumber; i++){
						indicatorLights[i] = 1;
				}
		}
		else if(lightNumber > 0 && lightNumber < 5){
				indicatorLights[13] = 1;
				for(i = 12; i > 12 - lightNumber; i--){
						indicatorLights[i] = 1;
				}
		}
		else if(lightNumber == 0){
				indicatorLights[13] = 1;
		}
	
		// https://ddddiy.blogspot.com/2014/02/74hct595n.html
		for(i = 0; i < 16; i++){
				LatchPin = 0;
				for(j = 15; j < 16; j--){
						ClockPin = 0;
						
						if(indicatorLights[j] == 1)
							DataPin = 1;
						else
							DataPin = 0;
						
						ClockPin = 1;
				}
				LatchPin = 1;
			
		}
}

/*
* position: 0~8, -1:turn 0ff
 */
void SetPwmLightRing(int position){
	
		//				*B3
		//		*A0			*B2
		//	*A1					*B1
		//		*A2			*B0
		//				*A3
		
		uint16_t brightnessArray[8] = {0};
		uint16_t i;
		
		for(i = 0;i < 8; i++){
				if(i > position)
					brightnessArray[i] = 0x0;
				else if(i == position)
					brightnessArray[i] = 0xFF0;
				else
					brightnessArray[i] = 0x100;
		}
		
		PWMA->CMR0 = brightnessArray[7];
		PWMA->CMR1 = brightnessArray[6];
		PWMA->CMR2 = brightnessArray[5];
		PWMA->CMR3 = brightnessArray[4];
								
		PWMB->CMR0 = brightnessArray[3];
		PWMB->CMR1 = brightnessArray[2];
		PWMB->CMR2 = brightnessArray[1];
		PWMB->CMR3 = brightnessArray[0];
}

/*
 * brightness:
 * 1>2>4>8>16>32>64>128>256>512>1024>2048
 */
void SetPwmLightRingFading(double brightness){
	
		uint16_t brightnessConverted;
	
		if(brightness > 11)
				return;
	
		//brightnessConverted = 0x1 << brightness / 2;
		brightnessConverted = pow(2, brightness);
		
		//printf("brightness %f %d\n",brightness , brightnessConverted);
		
		PWMA->CMR0 = brightnessConverted;
		PWMA->CMR1 = brightnessConverted;
		PWMA->CMR2 = brightnessConverted;
		PWMA->CMR3 = brightnessConverted;
								 
		PWMB->CMR0 = brightnessConverted;
		PWMB->CMR1 = brightnessConverted;
		PWMB->CMR2 = brightnessConverted;
		PWMB->CMR3 = brightnessConverted;		
}

/*
 * Effect type: 
 * 0: turn off
 * 1: revolve around
 * 2: fading
 * 3: pause(<0) or resume(>0) effect
 */
void SetLightRingEffect(int effectType, float timeLength){
		switch(effectType){
				case 0:
						pwmLightEffectType = 0;
						break;
				case 1:
						pwmLightEffectType = 1;
						pwmTimeLength = timeLength * 1000;
						pwmTimeLengthLeft = pwmTimeLength;
						printf("pwm light effect 1 with time %d ms\n", pwmTimeLengthLeft);
						break;
				case 2:
						pwmLightEffectType = 3;
						pwmTimeLength = timeLength * 1000;
						pwmTimeLengthLeft = pwmTimeLength;
						break;
				case 3:
						if(pwmLightEffectType == 1 && timeLength < 0){	// pause revolve
								pwmLightEffectType = 2;
						}
						else if(pwmLightEffectType == 2 && timeLength > 0){	// resume revolve
								pwmLightEffectType = 1;
						}
						else if(pwmLightEffectType == 3 && timeLength < 0){	// pause fading
								pwmLightEffectType = 4;
						}
						else if(pwmLightEffectType == 4 && timeLength > 0){	// resume fading
								pwmLightEffectType = 3;
						}
						break;
		}
}

void UpdateLightRingEffect(uint16_t elapsedFrameTime){
		
		float brightness;
		int position;
	
		if(pwmLightEffectType == 0 || pwmLightEffectType == 2 || pwmLightEffectType == 4)
				return;
		
