lisyaoran51/M0516_Test/AllPanelFunction/main.c
		if(pwmLightEffectType == 1){
			
				if(elapsedFrameTime < pwmTimeLengthLeft)
						pwmTimeLengthLeft -= elapsedFrameTime;
				else{
						pwmLightEffectType = 0;
						SetPwmLightRing(-1);
						return;
				}
				
				/* position = round(time left / total time * 8) */
				position = 8 - (int)(((float)pwmTimeLengthLeft) * 8.f / (float)pwmTimeLength + 0.5f);
				//printf("test float %f , %f , %f, %f\n", (float)pwmTimeLengthLeft ,((float)pwmTimeLengthLeft) * 8.f, ((float)pwmTimeLengthLeft) * 8.f / (float)pwmTimeLength, round(((float)pwmTimeLengthLeft) * 8.f / (float)pwmTimeLength));
				//printf("position %d, pwm time left %d\n", position, pwmTimeLengthLeft);
				if(position < 8){
						SetPwmLightRing(position);
				}
				else if(position == 8){
						SetPwmLightRing(7);
				}
		}
		else if(pwmLightEffectType == 3){
			
				pwmTimeLengthLeft -= elapsedFrameTime;
			
				if(pwmTimeLengthLeft < pwmTimeLength / 2){	// former half - lighting up
						brightness = (float)pwmTimeLengthLeft / (float)(pwmTimeLength / 2) * 12.f;
				}
				else if(pwmTimeLengthLeft < pwmTimeLength){	// latter half - darken down
						brightness = (float)(pwmTimeLength - pwmTimeLengthLeft) / (float)(pwmTimeLength / 2) * 12.f;
				}
				else{																				// restart a run
						pwmTimeLengthLeft = pwmTimeLength;
						return;
				}
				
				if(brightness < 12){
						SetPwmLightRingFading(brightness);
				}
				else if(brightness >= 12){
						SetPwmLightRingFading(12);
				}
			
		}
		
}

void DecodeMessage(char* message){
	
		// https://medium.com/andy%E7%9A%84%E8%B6%A3%E5%91%B3%E7%A8%8B%E5%BC%8F%E7%B7%B4%E5%8A%9F%E5%9D%8A/c%E8%AA%9E%E8%A8%80-03-%E7%A7%92%E6%87%82%E5%AD%97%E4%B8%B2%E8%99%95%E7%90%86%E5%87%BD%E6%95%B8-%E4%B8%8B-824253379483
		
		char* pointer;
		float value1, value2;
		
		pointer = strtok(message, ",");
		if(pointer == NULL)
			 return;
		
		if(strcmp(pointer, "RV") == 0){			// RV - Revolve around light ring
				pointer = strtok(NULL, ",");
				value1 = atof(pointer);
				if(value1 > 0)
						SetLightRingEffect(1, value1);
				else
						SetLightRingEffect(0, value1);	// turn off
		}
		else if(strcmp(pointer, "BT") == 0){// BT - bluetooth light ring
				pointer = strtok(NULL, ",");
				value1 = atof(pointer);
				if(value1 > 0)
						SetLightRingEffect(2, value1);
				else
						SetLightRingEffect(0, value1);	// turn off
		}
		else if(strcmp(pointer, "PS") == 0){	//PS - pause light ring
				pointer = strtok(NULL, ",");
				value1 = atof(pointer);
				
				SetLightRingEffect(3, value1);		// pause or resume
		}
		else if(strcmp(pointer, "IR") == 0){	//IR - indicator light
				pointer = strtok(NULL, ",");
				value1 = atoi(pointer);
				
				if(pointer != NULL)
						pointer = strtok(NULL, ",");
				else
					return;
				
				value2 = atoi(pointer);
				
				SetIndicatorLights(value1, value2);		// choose light to turn on or off
		}
		else if(strcmp(pointer, "SK") == 0){	//SK - Speed knob light ring
				pointer = strtok(NULL, ",");
				value1 = atoi(pointer);
				
				SetSpeedKnobLightRing(value1);		// set speed light ring or reset
		}
		else if(strcmp(pointer, "RS") == 0){	//RS - Reset all lights
				pointer = strtok(NULL, ",");
				value1 = atoi(pointer);
				
				SetLightRingEffect(0, 0);		// Turn off section light ring
				SetIndicatorLights(-1, 0);
		}
}

void ProcessI2cMessage(){
	
		char newCommand[16];
		
		if(i2cReadDataStartPos != i2cReadDataEndPos){
					
				memset(newCommand, 0x0, 16);
				memcpy(newCommand, i2cReadData[i2cReadDataStartPos], 16);
				
				i2cReadDataStartPos++;
				
				if(i2cReadDataStartPos == 16)
						i2cReadDataStartPos = 0;	
				
				printf("%s \n", newCommand);
				
				DecodeMessage(newCommand);
			
		}
}


/*---------------------------------------------------------------------------------------------------------*/
/* MAIN function                                                                                           */
/*---------------------------------------------------------------------------------------------------------*/
int main(void)
{
    int32_t i32Err;
		int count = 0;
		int lightPos = 0;
		
		char arr[] = "LR,2.55";
		
    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Init System, peripheral clock and multi-function I/O */
    //I2C0_SYS_Init();
		SYS_Init();
		
    /* Lock protected registers */
    SYS_LockReg();

    /* Init UART0 for printf */
    UART0_Init();
		/*
        To enable semihost, user must define "DEBUG_ENABLE_SEMIHOST" constant when build code with M051Series BSP.
        This sample code is used to show how to print message/getchar on IDE debug environment.
        It will echo all input character back on UART #1 of KEIL IDE.

        In KEIL MDK, user need to open "View->Serial Window->UART #1" windows in debug mode.
        In IAR Workbench, user need to open "View->Terminal I/O" in debug mode.

        NOTE1: HardFault_Handler handler is implemented in retarget.c.
        NOTE2: Semihost only works with Nuvoton NuLink ICE Dongle in debug mode.
        NOTE3: It does not print any message if Nuvoton NuLink ICE Dongle is not connected.
    */

	//while(1)printf("1\n");
	
    printf("\n\nCPU @ %d Hz\n", SystemCoreClock);
    printf("+-------------------------------------------------+\n");
    printf("|        All Panel Function Sample Code           |\n");
    printf("+-------------------------------------------------+\n\n");
		
		I2C0_Init();
		
		setPwm();
		
		setGpio();
		
		setI2c();

    setTimer();
		
		DecodeMessage(arr);
		
		
		/* --------------------main-----------------------*/
		
		// reset
		SetIndicatorLights(-1, 0);
		
		// fading light ring
		SetLightRingEffect(2, 3);
		
		while(1){
			
			ReadPanel();
			
			if(timerCount > lastAdcScanTimerCount + 0x10 || timerCount < lastAdcScanTimerCount){
					AdcContScanModeTest();
					lastAdcScanTimerCount = timerCount;
			}
			
			//if(count % 1000 == 0)
				//printf("%d\n", count);
			
			//if(timerCount % 1000 == 50){
			if(count % 1000 == 50 && 0){
					//SetPwmLightRing(lightPos / 2);
					SetIndicatorLights(lightPos, 1);
					SetIndicatorLights(lightPos - 1 < 0 ? 15 : lightPos - 1, 0);
					if(++lightPos == 16)
						lightPos = 0;
					
					SetSpeedKnobLightRing(lightPos / 2 - 4);
			}
			
			if(++count > 10000)
				count = 0;
			
			//if(timerCount % 1000 == 0)
			//	printf("%ds\n", timerCount / 1000);
			lastRunTimerCount = timerCount;
			if(timerCount == 0)
					debounceTimerCount = 0;
			
			/* 50 fps / update frame every 20 ms */
			if(timerCount > lastFrameTimerCount + 0x20 || timerCount < lastFrameTimerCount){
					
					if(timerCount > lastFrameTimerCount)
							UpdateLightRingEffect(timerCount - lastFrameTimerCount);
					lastFrameTimerCount = timerCount;
				
					ProcessI2cMessage();
			}
			
		}
			
		
		
		

    
}

/*** (C) COPYRIGHT 2013 Nuvoton Technology Corp. ***/
